In [81]:
import csv
import numpy as np
import pandas as pd

In [64]:
df = pd.read_csv('data/titanic.txt', index_col=0)
df.head()

,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
row.names,,,,,,,,,,
1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [65]:
X=df[['pclass','age','sex']]
y = df['survived']
print("Feature names:",list(X.columns))
print("Target Name:", y.name)

Feature names: ['pclass', 'age', 'sex']
Target Name: survived

In [66]:
#Check for missing values
X.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1313 entries, 1 to 1313
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  1313 non-null   object
 1   age     633 non-null    float64
 2   sex     1313 non-null   object
dtypes: float64(1), object(2)
memory usage: 41.0+ KB

In [67]:
mean = np.mean(X['age']);
print(mean)
X=X.fillna(value={'age':mean})
X.info()

31.19418104265403
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1313 entries, 1 to 1313
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   pclass  1313 non-null   object
 1   age     1313 non-null   float64
 2   sex     1313 non-null   object
dtypes: float64(1), object(2)
memory usage: 41.0+ KB

In [77]:
X['pclass'] = X['pclass'].astype('category')
X['sex'] = X['sex'].astype('category')

In [80]:
X['pclass'].cat.codes

row.names
1       0
2       0
3       0
4       0
5       0
       ..
1309    2
1310    2
1311    2
1312    2
1313    2
Length: 1313, dtype: int8